# St7GetPlateStyle

Returns the display style for plates.

Plate Entity Display

long St7GetPlateStyle(long uID, long* Style)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

Style

Plate display style; either psSurface or psSolid.